In [6]:
import datapackage

In [7]:
import pandas as pd

In [8]:
data_url = 'https://datahub.io/core/population/datapackage.json'

# to load Data Package into storage
package = datapackage.Package(data_url)

# to load only tabular data
resources = package.resources
for resource in resources:
    if resource.tabular:
        df = pd.read_csv(resource.descriptor['path'])
        print (df)

      Country Name Country Code  Year      Value
0       Arab World          ARB  1960   92197753
1       Arab World          ARB  1961   94724510
2       Arab World          ARB  1962   97334442
3       Arab World          ARB  1963  100034179
4       Arab World          ARB  1964  102832760
...            ...          ...   ...        ...
15404     Zimbabwe          ZWE  2014   13586681
15405     Zimbabwe          ZWE  2015   13814629
15406     Zimbabwe          ZWE  2016   14030390
15407     Zimbabwe          ZWE  2017   14236745
15408     Zimbabwe          ZWE  2018   14439018

[15409 rows x 4 columns]
      Country Name Country Code  Year      Value
0       Arab World          ARB  1960   92197753
1       Arab World          ARB  1961   94724510
2       Arab World          ARB  1962   97334442
3       Arab World          ARB  1963  100034179
4       Arab World          ARB  1964  102832760
...            ...          ...   ...        ...
15404     Zimbabwe          ZWE  2014   13586681
15405     Zimbabwe          ZWE  2015   13814629
15406     Zimbabwe          ZWE  2016   14030390
15407     Zimbabwe          ZWE  2017   14236745
15408     Zimbabwe          ZWE  2018   14439018

[15409 rows x 4 columns]

In [9]:
print(df.head())

  Country Name Country Code  Year      Value
0   Arab World          ARB  1960   92197753
1   Arab World          ARB  1961   94724510
2   Arab World          ARB  1962   97334442
3   Arab World          ARB  1963  100034179
4   Arab World          ARB  1964  102832760

In [11]:
df.describe()

               Year         Value
count  15409.000000  1.540900e+04
mean    1989.069764  2.081236e+08
std       17.031017  6.868312e+08
min     1960.000000  3.893000e+03
25%     1974.000000  9.268410e+05
50%     1989.000000  6.418773e+06
75%     2004.000000  4.244904e+07
max     2018.000000  7.594270e+09

In [12]:
df.head()

  Country Name Country Code  Year      Value
0   Arab World          ARB  1960   92197753
1   Arab World          ARB  1961   94724510
2   Arab World          ARB  1962   97334442
3   Arab World          ARB  1963  100034179
4   Arab World          ARB  1964  102832760

In [13]:
print(df.shape)

(15409, 4)

In [50]:
missing_values_count = df.isnull().sum()

In [52]:
print(missing_values_count)

Country Name    0
Country Code    0
Year            0
Value           0
dtype: int64

In [54]:
df.columns

Index(['Country Name', 'Country Code', 'Year', 'Value'], dtype='object')

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15409 entries, 0 to 15408
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Country Name  15409 non-null  object
 1   Country Code  15409 non-null  object
 2   Year          15409 non-null  int64
 3   Value         15409 non-null  int64
dtypes: int64(2), object(2)
memory usage: 481.7+ KB

In [14]:
df.describe()

               Year         Value
count  15409.000000  1.540900e+04
mean    1989.069764  2.081236e+08
std       17.031017  6.868312e+08
min     1960.000000  3.893000e+03
25%     1974.000000  9.268410e+05
50%     1989.000000  6.418773e+06
75%     2004.000000  4.244904e+07
max     2018.000000  7.594270e+09